//Задача №8: Цикличный вывод данных на экран
//Необходимо с помощью цикла вывести на экран числа от 1 до 50.
public class Task8 {
    public static void main(String args[]) {
        for (int x = 1; x <= 50; x = x + 1) {
            System.out.println(x);
        }
    }
}

